# 6. 데이터 선택 (기본)

In [1]:
import pandas as pd
df = pd.read_excel('score.xlsx', index_col='지원번호')
df

       이름   학교   국어   영어   수학   과학   사회    SW특기
지원번호
1번    강민수  세종초  100   85  100   85  100  Python
2번    배성현  포항초   95   90   95   90   95       C
3번    박세환  동탄초   90   95   90   95   90     C++
4번    정태경  덕소초   85  100   85  100   85     NaN

## Column 선택 (label)

In [2]:
df['이름']

지원번호
1번    강민수
2번    배성현
3번    박세환
4번    정태경
Name: 이름, dtype: object

In [3]:
df['학교']

지원번호
1번    세종초
2번    포항초
3번    동탄초
4번    덕소초
Name: 학교, dtype: object

In [4]:
df[['이름', '학교']]

       이름   학교
지원번호
1번    강민수  세종초
2번    배성현  포항초
3번    박세환  동탄초
4번    정태경  덕소초

## Column 선택 (정수 Index)

In [5]:
df.columns

Index(['이름', '학교', '국어', '영어', '수학', '과학', '사회', 'SW특기'], dtype='object')

In [6]:
df.columns[0]

'이름'

In [7]:
df.columns[2]

'국어'

In [8]:
df[df.columns[0]] #df['이름']과 동일한 동작

지원번호
1번    강민수
2번    배성현
3번    박세환
4번    정태경
Name: 이름, dtype: object

In [9]:
df[df.columns[-1]] #맨 끝에 있는 값을 가져옴

지원번호
1번    Python
2번         C
3번       C++
4번       NaN
Name: SW특기, dtype: object

## 슬라이싱

In [10]:
df

       이름   학교   국어   영어   수학   과학   사회    SW특기
지원번호
1번    강민수  세종초  100   85  100   85  100  Python
2번    배성현  포항초   95   90   95   90   95       C
3번    박세환  동탄초   90   95   90   95   90     C++
4번    정태경  덕소초   85  100   85  100   85     NaN

In [11]:
df['영어'][0:4] #0~3까지 영어 점수 데이터 가져옴

지원번호
1번     85
2번     90
3번     95
4번    100
Name: 영어, dtype: int64

In [12]:
df[['이름', '영어']][:3] #처음 3명의 이름. 영어 정보를 가져옴

       이름  영어
지원번호
1번    강민수  85
2번    배성현  90
3번    박세환  95

In [13]:
df[3:]

       이름   학교  국어   영어  수학   과학  사회 SW특기
지원번호
4번    정태경  덕소초  85  100  85  100  85  NaN